AM = 319051;


%1ο ερώτημα
%α
A = 4;  %   πλάτος τριγωνικού παλμού
N = 4;  %   επιθυμητό πλήθος περιόδων
fm = mod(AM,1000);
while fm > 9
    fm = mod(fm,10) + fix(fm/10);
end
fm = fm * 1000;  %   συχνότητα όπως προκύπτει από τον ΑΜ
fs1 = 30*fm;    %   πρώτη συχνότητα δειγματοληψίας
fs2 = 50*fm;    %   δεύτερη συχνότητα δειγματοληψίας
t1 = 0:1/fs1:N/fm;  %   πρώτος χρονικός άξονας
t2 = 0:1/fs2:N/fm;  %   δεύτερος χρονικός άξονας
trig1 = A*sawtooth(2*pi*fm*t1,1/2); %   δειγματοληψία συχνότητας fs1 από τριγωνική κυματομορφή συχνότητας fs, πλάτους Α
trig2 = A*sawtooth(2*pi*fm*t2,1/2); %   δειγματοληψία συχνότητας fs2 από τριγωνική κυματομορφή συχνότητας fs, πλάτους Α

plot(t1,trig1,'o')  %   γράφημα δειγμάτων πρώτης δειγματοληψίας
grid on;
title('Δείγματα trig_1(t) κατόπιν δειγματοληψίας με συχνότητα f_{s1}=30f_m');
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');

figure;
plot(t2,trig2,'x')  %   γράφημα δειγμάτων δεύτερης δειγματοληψίας
grid on;
title('Δείγματα trig_2(t) κατόπιν δειγματοληψίας με συχνότητα f_{s2}=50f_m');
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');

figure;
plot(t1,trig1,'o',t2,trig2,'x')
grid on;
title('Κοινό διάγραμμα δειγμάτων trig_1(t), trig_2(t)'); %  κοινό γράφημα δειγμάτων αμφοτέρων των δειγματοληψιών
legend('Τριγωνική κυματομορφή συχνότητας f_{s1}=30f_m', 'Τριγωνική κυματομορφή συχνότητας f_{s2}=50f_m')
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');
%τέλος α

%β
fs = 4*fm;
t = 0:1/fs:1/fm;
trig = A*sawtooth(2*pi*fm*t,1/2);
figure;
plot(t,trig,'o');
grid on;
title('Δείγματα trig(t) κατόπιν δειγματοληψίας με συχνότητα f_s=4f_m');
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');
% τέλος β

%γ
%i
Az = 1; %   πλάτος κυματομορφής
z1 = Az*sin(2*pi*fm*t1);    %   δείγματα κατόπιν δειγματοληψίας συχνότητας fs1
z2 = Az*sin(2*pi*fm*t2);    %   δείγματα κατόπιν δειγματοληψίας συχνότητας fs2

figure;
plot(t1,z1,'o')  %  γράφημα δειγμάτων πρώτης δειγματοληψίας
grid on;
title('Δείγματα z_1(t) κατόπιν δειγματοληψίας με συχνότητα f_{s1}=30f_m');
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');

figure;
plot(t2,z2,'x')  %  γράφημα δειγμάτων δεύτερης δειγματοληψίας
grid on;
title('Δείγματα z_2(t) κατόπιν δειγματοληψίας με συχνότητα f_{s2}=50f_m');
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');

figure;
plot(t1,z1,'o',t2,z2,'x')
grid on;
title('Κοινό διάγραμμα δειγμάτων z_1(t), z_2(t)'); %    κοινό γράφημα δειγμάτων αμφοτέρων των δειγματοληψιών
legend('Ημίτονο συχνότητας f_{s1}=30f_m', 'Ημίτονο συχνότητας f_{s2}=50f_m')
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');

z = Az*sin(2*pi*fm*t);
figure;
plot(t,z,'o');
grid on;
title('Δείγματα κατόπιν z(t) δειγματοληψίας με συχνότητα f_s=4f_m');
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');

%ii
L = 10^3;
tq1 = 0:1/fs1:1/fm; %   εύρος μίας περιόδου αντί τεσσάρων με δείγματα ανά fs1
tq2 = 0:1/fs2:1/fm; %   εύρος μίας περιόδου αντί τεσσάρων με δείγματα ανά fs2
zq1 = Az*sin(2*pi*fm*tq1);  %   δείγματα της Ζ (με συχνότητα fs1) στο κατάλληλο χρονικό εύρος
zq2 = Az*sin(2*pi*fm*tq2);  %   δείγματα της Ζ (με συχνότητα fs2) στο κατάλληλο χρονικό εύρος
q1 = zq1 + Az*sin(2*pi*(fm+L)*tq1);
q2 = zq2 + Az*sin(2*pi*(fm+L)*tq2);

figure;
plot(tq1,q1,'o')  % γράφημα δειγμάτων πρώτης δειγματοληψίας
grid on;
title('Δείγματα q_1(t) κατόπιν δειγματοληψίας με συχνότητα f_{s1}=30f_m');
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');

figure;
plot(tq2,q2,'x')  % γράφημα δειγμάτων δεύτερης δειγματοληψίας
grid on;
title('Δείγματα q_2(t) κατόπιν δειγματοληψίας με συχνότητα f_{s2}=50f_m');
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');

q = z + Az*sin(2*pi*(fm+L)*t);
figure;
plot(t,q,'o');
grid on;
title('Δείγματα q(t) κατόπιν δειγματοληψίας με συχνότητα f_s=4f_m');
ylabel('Πλάτος (Volt)');
xlabel('Χρόνος (sec)');
% τέλος γ
% τέλος 1ου ερωτήματος
